Java-Web/layout_tpl.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-11-22 周四 02:16 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>页面跟布局</title>
<meta name="generator" content="Org mode">
<meta name="author" content="孙悟空">
<link rel='stylesheet' href='/asset/common.css' />
</head>
<body>
<div id="content">
<header>
<h1 class="title">页面跟布局</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgee70f60">1. include</a></li>
<li><a href="#org4fa25de">2. SiteMesh</a></li>
<li><a href="#org71a4843">3. Apache Tile</a></li>
</ul>
</div>
</nav>


<section id="outline-container-orgee70f60" class="outline-2">
<h2 id="orgee70f60"><span class="section-number-2">1</span> include</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><code>&lt;jsp:include&gt;</code></li>
<li><code>&lt;%@include file="xxx"&gt;</code></li>
</ul>
</div>
</section>

<section id="outline-container-org4fa25de" class="outline-2">
<h2 id="org4fa25de"><span class="section-number-2">2</span> SiteMesh</h2>
<div class="outline-text-2" id="text-2">
<p>
<b>首先</b>，将 jar 包添加到项目中:
</p>
<pre class="example">
opensymphony:sitemesh:2.4.2
</pre>

<p>
<b>其次</b>，在 web.xml 中添加过滤器，将所有请求交给 SiteMesh 过滤
</p>
<pre class="example">
com.opensymphony.sitemesh.webapp.SiteMeshFilter
</pre>

<p>
<b>然后</b>，添加 SiteMesh 的配置文件 <code>WEB-INF/decorators.xml</code>:
</p>
<div class="org-src-container">
<pre class="src src-sgml"><span class="org-string">&lt;?xml version="1.0" encoding="utf-8" ?&gt;</span>
&lt;<span class="org-function-name">decorators</span> <span class="org-variable-name">defaultdir</span>=<span class="org-string">"/jsp/layouts/"</span>&gt;
  <span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">&#20808;&#23450;&#20041;&#19981;&#36807;&#28388;&#30340;&#39029;&#38754;&#65292;&#21363;&#25490;&#38500;&#39029;&#38754; </span><span class="org-comment-delimiter">--&gt;</span>
  &lt;<span class="org-function-name">excludes</span>&gt;
    &lt;<span class="org-function-name">pattern</span>&gt;/assets/*&lt;/<span class="org-function-name">pattern</span>&gt;
  &lt;/<span class="org-function-name">excludes</span>&gt;

  <span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">&#23450;&#20041;&#38656;&#35201;&#20462;&#39280;&#30340;&#39029;&#38754; </span><span class="org-comment-delimiter">--&gt;</span>
  &lt;<span class="org-function-name">decorator</span> <span class="org-variable-name">name</span>=<span class="org-string">"book"</span> <span class="org-variable-name">page</span>=<span class="org-string">"book_tpl.jsp"</span>&gt;
    &lt;<span class="org-function-name">pattern</span>&gt;/*&lt;/<span class="org-function-name">pattern</span>&gt;
  &lt;/<span class="org-function-name">decorator</span>&gt;
&lt;/<span class="org-function-name">decorators</span>&gt;
</pre>
</div>

<p>
<b>之后</b>，创建模板文件 <code>jsp/layouts/book_tpl.jsp</code>:
</p>
<div class="org-src-container">
<pre class="src src-html"><span class="org-string">&lt;!doctype html&gt;</span>
&lt;<span class="org-function-name">html</span> <span class="org-variable-name">lang</span>=<span class="org-string">"en"</span>&gt;
  &lt;<span class="org-function-name">head</span>&gt;
    &lt;<span class="org-function-name">title</span>&gt;&lt;<span class="org-sgml-namespace">sitemesh</span>:<span class="org-function-name">title</span> /&gt;&lt;/<span class="org-function-name">title</span>&gt;
    &lt;<span class="org-sgml-namespace">sitemesh</span>:<span class="org-function-name">head</span> /&gt;
  &lt;/<span class="org-function-name">head</span>&gt;
  &lt;<span class="org-function-name">body</span>&gt;
    &lt;<span class="org-function-name">header</span>&gt;
      &lt;%@include <span class="org-variable-name">file</span>=<span class="org-string">"book_header.jsp"</span> /&gt;
    &lt;/<span class="org-function-name">header</span>&gt;

    &lt;<span class="org-function-name">div</span>&gt;
      &lt;<span class="org-sgml-namespace">sitemesh</span>:<span class="org-function-name">body</span> /&gt;
    &lt;/<span class="org-function-name">div</span>&gt;

    &lt;<span class="org-function-name">footer</span>&gt;
      &lt;%@include <span class="org-variable-name">file</span>=<span class="org-string">"book_footer.jsp"</span> /&gt;
    &lt;/<span class="org-function-name">footer</span>&gt;


    <span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">&#20854;&#20182;&#29992;&#27861; </span><span class="org-comment-delimiter">--&gt;</span>

    <span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">&#21487;&#20197;&#36890;&#36807; meta &#22312;&#39029;&#38754;&#20043;&#38388;&#20256;&#36882;&#25968;&#25454; </span><span class="org-comment-delimiter">--&gt;</span>
    <span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">&lt;meta name='xxx' content='ksjfkjskf' </span><span class="org-comment-delimiter">--&gt;</span>
    &lt;<span class="org-sgml-namespace">decorator</span>:<span class="org-function-name">getProperty</span> <span class="org-variable-name">property</span>=<span class="org-string">"meta.xxx"</span> /&gt;

    <span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">&#21487;&#20197;&#36890;&#36807; usePage &#24341;&#29992;&#21040;&#21407;&#22987;&#39029;&#38754;&#30340; jsp &#23545;&#35937; </span><span class="org-comment-delimiter">--&gt;</span>
    &lt;<span class="org-sgml-namespace">decorator</span>:<span class="org-function-name">usePage</span> <span class="org-variable-name">id</span>=<span class="org-string">"myPage"</span> /&gt;
    &lt;%= myPage.getRequest().getAttribute(<span class="org-string">"xxx"</span>) %&gt;

    <span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">&#20854;&#20182;&#65292;&#33258;&#34892;&#24635;&#32467; </span><span class="org-comment-delimiter">--&gt;</span>
  &lt;/<span class="org-function-name">body</span>&gt;
&lt;/<span class="org-function-name">html</span>&gt;
</pre>
</div>

<p>
最后，就可以使用了。
</p>
</div>
</section>

<section id="outline-container-org71a4843" class="outline-2">
<h2 id="org71a4843"><span class="section-number-2">3</span> Apache Tile</h2>
<div class="outline-text-2" id="text-3">
<p>
另一款比较流行的页面布局插件。它比 SiteMesh 复杂，但更灵活。
</p>
</div>
</section>
</div>
<div id="postamble" class="status">
<p class="author">Author: 孙悟空</p>
<p class="date">Created: 2018-11-22 周四 02:16</p>
<p class="validation">Go ahead, never stop.</p>
</div>
</body>
</html>
